In [6]:
import numpy as np
import pandas as pd

In [30]:
# Создаем DataFrame с NaN значениями
data = {'Колонка A': [1, 2, np.nan, 4],
        'Колонка B': [5, np.nan, 7, 8],
        'Колонка C': [9, 10, 11, 12]}
df = pd.DataFrame(data)

In [28]:
df

   Колонка A  Колонка B  Колонка C
0        1.0        5.0          9
1        NaN        NaN         10
2        NaN        7.0         11
3        4.0        8.0         12

# Заменяем все NaN на value

В нашем случае value = 0

In [26]:
df["Колонка A"] = df["Колонка A"].fillna(df["Колонка A"].mean())

df

   Колонка A  Колонка B  Колонка C
0   1.000000        5.0          9
1   2.000000        NaN         10
2   2.333333        7.0         11
3   4.000000        8.0         12

In [9]:
df_filled = df.fillna(0)
df_filled

   Колонка A  Колонка B  Колонка C
0        1.0        5.0          9
1        2.0        0.0         10
2        0.0        7.0         11
3        4.0        8.0         12

In [10]:
df_replaced = df.replace(np.nan, 0)
df_replaced

   Колонка A  Колонка B  Колонка C
0        1.0        5.0          9
1        2.0        0.0         10
2        0.0        7.0         11
3        4.0        8.0         12

# Удаление NaN

In [11]:
df

   Колонка A  Колонка B  Колонка C
0        1.0        5.0          9
1        2.0        NaN         10
2        NaN        7.0         11
3        4.0        8.0         12

In [12]:
#Удаляет все строки или столбцы, содержащие NaN значения, из DataFrame. По умолчанию удаляются строки.
df_droped_rows = df.dropna(axis="rows")
df_droped_rows

   Колонка A  Колонка B  Колонка C
0        1.0        5.0          9
3        4.0        8.0         12

In [13]:
#  Удаляет столбцы, содержащие NaN значения, из DataFrame.
df_droped_cols = df.dropna(axis="columns")
df_droped_cols

   Колонка C
0          9
1         10
2         11
3         12

In [29]:
# Удаляет строки, в которых количество непропущенных значений меньше n.
df_droped_for_n = df.dropna(thresh=2)
df_droped_for_n

   Колонка A  Колонка B  Колонка C
0        1.0        5.0          9
2        NaN        7.0         11
3        4.0        8.0         12

# Проверка на наличие NaN

In [15]:
df

   Колонка A  Колонка B  Колонка C
0        1.0        5.0          9
1        2.0        NaN         10
2        NaN        7.0         11
3        4.0        8.0         12

In [ ]:
list1 = [1, 2, 3]

list2 = [
    [1,2,3], 
    [4,5,6], 
    [7,8,9]
         ]

In [33]:
# .any()
df.isna().any().any()

True

In [17]:
df.notna()

   Колонка A  Колонка B  Колонка C
0       True       True       True
1       True      False       True
2      False       True       True
3       True       True       True

# Интерполяция

In [36]:
data = {'A': [1, 0, 0, 1, 1],
        'B': [1, 0, 0, 0, 1],
        'C' : [0, 1, 1, 1, 0],
        'D' : [np.nan, 1,0,0,1],
        'E' : [0, 1,0,0, np.nan],
}
df = pd.DataFrame(data)

In [37]:
df

   A  B  C    D    E
0  1  1  0  NaN  0.0
1  0  0  1  1.0  1.0
2  0  0  1  0.0  0.0
3  1  0  1  0.0  0.0
4  1  1  0  1.0  NaN

In [39]:
df_interpolated = df.interpolate()
df_interpolated

   A  B  C    D    E
0  1  1  0  NaN  0.0
1  0  0  1  1.0  1.0
2  0  0  1  0.0  0.0
3  1  0  1  0.0  0.0
4  1  1  0  1.0  0.0